In [47]:
import pandas as pd
import numpy as np
from datetime import datetime

### TODO
Weekly assignment for practice : 
ðŸŽ¯ Objective:
Perform data cleaning and analysis on employee performance data using Python (pandas) and save the output in an Excel file with multiple sheets.

Data set : https://docs.google.com/spreadsheets/d/1wrH9VMn3BB1t8Y5F7bmtC0z0-8QCRFRf/edit?usp=drive_link&ouid=106177324977353126171&rtpof=true&sd=true

âœ… Tasks to Perform in Python:
ðŸ”¹ 1. Data Cleaning
Load the data using pandas.

Convert JoinDate to datetime format (dd-mm-yyyy).

Ensure Salary and PerformanceRating are numeric.

Check and handle any missing values (if any).

ðŸ”¹ 2. Feature Engineering
Create a new column Tenure:
â†’ Tenure = 2025 âˆ’ Year(JoinDate)

Create a new column SalaryCategory:

Salary < 50,000 â†’ "Low"

Salary between 50,000â€“90,000 â†’ "Medium"

Salary > 90,000 â†’ "High"

ðŸ”¹ 3. Aggregated Analysis (GroupBy / Pivot Logic)
Generate the following summary tables:

avg_salary_by_dept: Average Salary per Department

gender_count_by_dept: Count of Employees by Gender and Department

avg_rating_by_dept: Average Performance Rating per Department

low_performers: Employees with Performance Rating â‰¤ 2

ðŸ”¹ 4. Output
Save all the above into a single Excel file with multiple sheets using pandas.ExcelWriter.

ðŸ§ª Bonus (Optional)
Create visualizations (bar chart, pie chart) using matplotlib or seaborn.

ðŸ“¦ Deliverables
Python script or Jupyter notebook (.py or .ipynb)

Cleaned and analyzed Excel file (employee_analysis_result.xlsx)

(Optional) Screenshots of plots

In [48]:
df = pd.read_csv('employee_performance.csv')

In [49]:
df.head()

,EmployeeID,Name,Gender,Department,Salary,JoinDate,PerformanceRating
0,E001,Dr. Lisa Rogers,Male,Marketing,108988.18,13-11-2021,4
1,E002,Nichole Peterson,Female,Finance,31002.41,02-07-2015,5
2,E003,Paul Blair,Female,Sales,73663.33,04-05-2023,1
3,E004,Michelle Thomas,Other,Marketing,84044.55,18-11-2019,1
4,E005,Jessica Berg,Female,Marketing,92527.68,30-11-2019,3

In [50]:
#checking some requirenment satisfieed
#Stripping extra-spaces from columns name
df.columns = [x.strip() for x in df.columns]

In [51]:
# so datetime is not in format because there is leading space so we need to strip the space
df['JoinDate'] = df['JoinDate'].apply(lambda x:x.strip())

In [52]:
def is_correct_fmt(date,fmt="%d-%m-%Y"):
    
    try:
        datetime.strptime(date,fmt)
        return True
    except ValueError as e:
        print(e)
        return False

is_date_formatted = df['JoinDate'].apply(is_correct_fmt)

print(is_date_formatted.value_counts()) # all 50 value in correct-date format

JoinDate
True    50
Name: count, dtype: int64

In [53]:
# Ensure Salary and PerformanceRating are numeric.
df['Salary'].info()
print(df['Salary'].dtypes)
# yes-its of dtype of float
print("type of elements of perfomance-rating: ",df['PerformanceRating'].dtypes)

<class 'pandas.core.series.Series'>
RangeIndex: 50 entries, 0 to 49
Series name: Salary
Non-Null Count  Dtype
--------------  -----
50 non-null     float64
dtypes: float64(1)
memory usage: 532.0 bytes
float64
type of elements of perfomance-rating:  int64

In [54]:
# finding and handling any missing values
df.isna().sum() #no-missing values there

EmployeeID           0
Name                 0
Gender               0
Department           0
Salary               0
JoinDate             0
PerformanceRating    0
dtype: int64

In [55]:
## creating a new columns Tenure 2025 - Year
year_col = [datetime.strptime(date,"%d-%m-%Y").year for date in df['JoinDate']]
print(year_col)
df['Tenure'] = [2025 - year for year in year_col]

[2021, 2015, 2023, 2019, 2019, 2017, 2015, 2018, 2023, 2017, 2018, 2022, 2022, 2023, 2023, 2019, 2021, 2019, 2021, 2016, 2017, 2019, 2022, 2022, 2015, 2018, 2017, 2017, 2016, 2022, 2020, 2021, 2022, 2021, 2020, 2022, 2022, 2021, 2018, 2021, 2019, 2020, 2018, 2021, 2017, 2022, 2020, 2022, 2022, 2018]

In [56]:
df.head(10)

,EmployeeID,Name,Gender,Department,Salary,JoinDate,PerformanceRating,Tenure
0,E001,Dr. Lisa Rogers,Male,Marketing,108988.18,13-11-2021,4,4
1,E002,Nichole Peterson,Female,Finance,31002.41,02-07-2015,5,10
2,E003,Paul Blair,Female,Sales,73663.33,04-05-2023,1,2
3,E004,Michelle Thomas,Other,Marketing,84044.55,18-11-2019,1,6
4,E005,Jessica Berg,Female,Marketing,92527.68,30-11-2019,3,6
5,E006,Hannah Reed,Male,IT,95398.62,07-08-2017,5,8
6,E007,Lisa Allen,Male,IT,66718.87,28-09-2015,5,10
7,E008,Crystal Harper,Female,HR,109894.50,19-02-2018,4,7
8,E009,Sharon Anthony,Male,Finance,31208.47,18-02-2023,3,2
9,E010,Jake Martinez,Male,Marketing,56227.01,15-07-2017,5,8

In [57]:

# Create a new column SalaryCategory:
from datetime import datetime
df = pd.read_csv('employee_performance.csv')
df.head()
#checking some requirenment satisfieed
#Stripping extra-spaces from columns name
df.columns = [x.strip() for x in df.columns]

# so datetime is not in format because there is leading space so we need to strip the space
df['JoinDate'] = df['JoinDate'].apply(lambda x:x.strip())
def is_correct_fmt(date,fmt="%d-%m-%Y"):
    
    try:
        datetime.strptime(date,fmt)
        return True
    except ValueError as e:
        print(e)
        return False

is_date_formatted = df['JoinDate'].apply(is_correct_fmt)

print(is_date_formatted.value_counts()) # all 50 value in correct-date format
# Ensure Salary and PerformanceRating are numeric.
df['Salary'].info()
print(df['Salary'].dtypes)
# yes-its of dtype of float
print("type of elements of perfomance-rating: ",df['PerformanceRating'].dtypes)
# finding and handling any missing values
df.isna().sum() #no-missing values there 
## creating a new columns Tenure 2025 - Year
year_col = [datetime.strptime(date,"%d-%m-%Y").year for date in df['JoinDate']]
print(year_col)
df['Tenure'] = [2025 - year for year in year_col]
df.head(10)
# creating new columns SalaryCategory
"""
pd.cut()
Bin values into discrete intervals.
Use cut when you need to segment and sort data values into bins. This function is also useful for going from a continuous variable to a categorical variable. For example, cut could convert ages to groups of age ranges. Supports binning into an equal number of bins, or a pre-specified array of bins
"""
df['SalaryCategory'] = pd.cut(df['Salary'],bins=[0,50000,90000,float('inf')],labels=['Low','Medium','High'])

JoinDate
True    50
Name: count, dtype: int64
<class 'pandas.core.series.Series'>
RangeIndex: 50 entries, 0 to 49
Series name: Salary
Non-Null Count  Dtype
--------------  -----
50 non-null     float64
dtypes: float64(1)
memory usage: 532.0 bytes
float64
type of elements of perfomance-rating:  int64
[2021, 2015, 2023, 2019, 2019, 2017, 2015, 2018, 2023, 2017, 2018, 2022, 2022, 2023, 2023, 2019, 2021, 2019, 2021, 2016, 2017, 2019, 2022, 2022, 2015, 2018, 2017, 2017, 2016, 2022, 2020, 2021, 2022, 2021, 2020, 2022, 2022, 2021, 2018, 2021, 2019, 2020, 2018, 2021, 2017, 2022, 2020, 2022, 2022, 2018]

In [58]:
df.head(10)

,EmployeeID,Name,Gender,Department,Salary,JoinDate,PerformanceRating,Tenure,SalaryCategory
0,E001,Dr. Lisa Rogers,Male,Marketing,108988.18,13-11-2021,4,4,High
1,E002,Nichole Peterson,Female,Finance,31002.41,02-07-2015,5,10,Low
2,E003,Paul Blair,Female,Sales,73663.33,04-05-2023,1,2,Medium
3,E004,Michelle Thomas,Other,Marketing,84044.55,18-11-2019,1,6,Medium
4,E005,Jessica Berg,Female,Marketing,92527.68,30-11-2019,3,6,High
5,E006,Hannah Reed,Male,IT,95398.62,07-08-2017,5,8,High
6,E007,Lisa Allen,Male,IT,66718.87,28-09-2015,5,10,Medium
7,E008,Crystal Harper,Female,HR,109894.50,19-02-2018,4,7,High
8,E009,Sharon Anthony,Male,Finance,31208.47,18-02-2023,3,2,Low
9,E010,Jake Martinez,Male,Marketing,56227.01,15-07-2017,5,8,Medium

In [59]:
# average of salary per dept
avg_sal_per_dept = df.groupby('Department',group_keys=True)['Salary'].mean().round(2)

In [60]:
# gender count per Dept
gender_count_by_dept = pd.crosstab(df['Department'],df['Gender'])
gender_count_by_dept

Gender      Female  Male    Other
Department
Finance          4       6       2
HR               5       1       1
IT               4       2       1
Marketing        3       5       4
Sales            7       3       2

In [61]:
# average performance rating per dept

In [62]:
performance_rate_per_dept = df.groupby('Department',group_keys=True)['PerformanceRating'].mean().round(2)
performance_rate_per_dept

Department
Finance       2.42
HR            3.14
IT            3.71
Marketing     3.17
Sales         2.92
Name: PerformanceRating, dtype: float64

In [63]:
# low-performer Employee
low_performer_empId = df[df['PerformanceRating'] <=2]['EmployeeID'].reset_index()

In [64]:
low_performer_empId

    index  EmployeeID
0       2  E003
1       3  E004
2      12  E013
3      13  E014
4      14  E015
5      17  E018
6      24  E025
7      26  E027
8      27  E028
9      28  E029
10     29  E030
11     31  E032
12     35  E036
13     37  E038
14     38  E039
15     40  E041
16     41  E042
17     46  E047
18     47  E048
19     48  E049

In [69]:
! pip install xlsxwriter

Collecting xlsxwriter
  Downloading xlsxwriter-3.2.5-py3-none-any.whl.metadata (2.7 kB)
Downloading xlsxwriter-3.2.5-py3-none-any.whl (172 kB)
Installing collected packages: xlsxwriter
Successfully installed xlsxwriter-3.2.5

In [71]:
# writting all to excel-sheet

with pd.ExcelWriter('OutputCleaned.xlsx',engine='xlsxwriter') as exl_write:
    df.to_excel(exl_write,'Main Dataset Cleaned')
    avg_sal_per_dept.to_excel(exl_write,'avg_salary_dept')
    gender_count_by_dept.to_excel(exl_write,'gender_count_per_dept')
    performance_rate_per_dept.to_excel(exl_write,'performance_rate_per_dept')
    performance_rate_per_dept.to_excel(exl_write,'performance_rate_per_dept')
    low_performer_empId.to_excel(exl_write,'low_performing_employee')

/var/folders/s3/ryhy831n0lqcwrghx69z28xw0000gn/T/ipykernel_10281/4278684210.py:4: FutureWarning: Starting with pandas version 3.0 all arguments of to_excel except for the argument 'excel_writer' will be keyword-only.
  df.to_excel(exl_write,'Main Dataset Cleaned')
/var/folders/s3/ryhy831n0lqcwrghx69z28xw0000gn/T/ipykernel_10281/4278684210.py:5: FutureWarning: Starting with pandas version 3.0 all arguments of to_excel except for the argument 'excel_writer' will be keyword-only.
  avg_sal_per_dept.to_excel(exl_write,'avg_salary_dept')
/var/folders/s3/ryhy831n0lqcwrghx69z28xw0000gn/T/ipykernel_10281/4278684210.py:6: FutureWarning: Starting with pandas version 3.0 all arguments of to_excel except for the argument 'excel_writer' will be keyword-only.
  gender_count_by_dept.to_excel(exl_write,'gender_count_per_dept')
/var/folders/s3/ryhy831n0lqcwrghx69z28xw0000gn/T/ipykernel_10281/4278684210.py:7: FutureWarning: Starting with pandas version 3.0 all arguments of to_excel except for the argument 'excel_writer' will be keyword-only.
  performance_rate_per_dept.to_excel(exl_write,'performance_rate_per_dept')
/var/folders/s3/ryhy831n0lqcwrghx69z28xw0000gn/T/ipykernel_10281/4278684210.py:8: FutureWarning: Starting with pandas version 3.0 all arguments of to_excel except for the argument 'excel_writer' will be keyword-only.
  performance_rate_per_dept.to_excel(exl_write,'performance_rate_per_dept')
/var/folders/s3/ryhy831n0lqcwrghx69z28xw0000gn/T/ipykernel_10281/4278684210.py:9: FutureWarning: Starting with pandas version 3.0 all arguments of to_excel except for the argument 'excel_writer' will be keyword-only.
  low_performer_empId.to_excel(exl_write,'low_performing_employee')